/*
 *  TOPPERS/JSP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Just Standard Profile Kernel
 * 
 *  Copyright (C) 2000 by Embedded and Real-Time Systems Laboratory
 *                              Toyohashi Univ. of Technology, JAPAN
 * 
 *  ╛х╡н├°║ю╕в╝╘д╧бд░╩▓╝д╬╛Є╖ядЄ╦■д┐д╣╛ь╣чд╦╕┬дъбд╦▄е╜е╒е╚ежезевб╩╦▄е╜
 *  е╒е╚ежезевдЄ▓■╩╤д╖д┐дтд╬дЄ┤▐дрбе░╩▓╝╞▒д╕б╦дЄ╗╚═╤бж╩г└╜бж▓■╩╤бж║╞╟█
 *  ╔█б╩░╩▓╝бд═°═╤д╚╕╞д╓б╦д╣дыд│д╚дЄ╠╡╜■д╟╡Ў┬·д╣дыбе
 *  (1) ╦▄е╜е╒е╚ежезевдЄе╜б╝е╣е│б╝е╔д╬╖┴д╟═°═╤д╣ды╛ь╣чд╦д╧бд╛х╡нд╬├°║ю
 *      ╕в╔╜╝ибдд│д╬═°═╤╛Є╖ядкдшд╙▓╝╡нд╬╠╡╩▌╛┌╡м─ъдмбдд╜д╬д▐д▐д╬╖┴д╟е╜б╝
 *      е╣е│б╝е╔├цд╦┤▐д▐дьд╞дддыд│д╚бе
 *  (2) ╦▄е╜е╒е╚ежезевдЄе╨еде╩еъе│б╝е╔д╬╖┴д▐д┐д╧╡б┤яд╦┴╚д▀╣■дєд└╖┴д╟═°
 *      ═╤д╣ды╛ь╣чд╦д╧бд╝бд╬ддд║дьдлд╬╛Є╖ядЄ╦■д┐д╣д│д╚бе
 *    (a) ═°═╤д╦╚╝дже╔енехесеєе╚б╩═°═╤╝╘е▐е╦ехевеыд╩д╔б╦д╦бд╛х╡нд╬├°║ю
 *        ╕в╔╜╝ибдд│д╬═°═╤╛Є╖ядкдшд╙▓╝╡нд╬╠╡╩▌╛┌╡м─ъдЄ╖╟║▄д╣дыд│д╚бе
 *    (b) ═°═╤д╬╖┴┬╓дЄбд╩╠д╦─ъдсды╩¤╦бд╦дшд├д╞бд╛х╡н├°║ю╕в╝╘д╦╩є╣Ёд╣ды
 *        д│д╚бе
 *  (3) ╦▄е╜е╒е╚ежезевд╬═°═╤д╦дшдъ─╛└▄┼кд▐д┐д╧┤╓└▄┼кд╦└╕д╕дыдддлд╩ды┬╗
 *      │▓длдщдтбд╛х╡н├°║ю╕в╝╘дЄ╠╚└╒д╣дыд│д╚бе
 * 
 *  ╦▄е╜е╒е╚ежезевд╧бд╠╡╩▌╛┌д╟─є╢бд╡дьд╞дддыдтд╬д╟двдыбе╛х╡н├°║ю╕в╝╘д╧бд
 *  ╦▄е╜е╒е╚ежезевд╦┤╪д╖д╞бдд╜д╬┼м═╤▓─╟╜└ндт┤▐дсд╞бддддлд╩ды╩▌╛┌дт╣╘дя
 *  д╩ддбед▐д┐бд╦▄е╜е╒е╚ежезевд╬═°═╤д╦дшдъ─╛└▄┼кд▐д┐д╧┤╓└▄┼кд╦└╕д╕д┐дд
 *  длд╩ды┬╗│▓д╦┤╪д╖д╞дтбдд╜д╬└╒╟ддЄ╔щдяд╩ддбе
 * 
 *  @(#) $Id: rsh3.h,v 1.1 2000/11/14 16:30:22 honda Exp $
 */

#ifndef _RSH3_ 
#define _RSH3_ 

#include "sh3.h"

/*
 *  RSH3$B$N%O!<%I%&%'%";q8;$NDj5A(B
 */



#endif /*  _RSH3_ */



